/*перша нормальна форма*/

Drop database if exists Task_2;
create database Task_2;
use Task_2;
alter database Task_2 character set utf8mb4;


create table Звітність_по_видачі_зброї
(
ID int auto_increment not null,
ПІБ_отримавшого varchar(30) not null,
Офіс_отримавшого int,
Взвод int not null,
Зброя varchar(20) not null,
Зброю_видав varchar(30) not null,
Звання_видавшого varchar(20),
primary key (ID)
);


insert into Звітність_по_видачі_зброї
(ПІБ_отримавшого, Офіс_отримавшого, Взвод, Зброя, Зброю_видав, Звання_видавшого)
values
('Петров В.А.', 205, 222, 'АК-47', 'Буров О.С.', 'майор'),
('Петров В.А.', 205, 222, 'Глок20', 'Рибаков Н.Г.', 'майор'),
('Лодарев П.С.', 221, 232, 'АК-74', 'Деребанов В.Я.', 'підполковник'),
('Лодарев П.С.', 221, 232, 'Глок20', 'Рибаков Н.Г.', 'майор'),
('Іващенко А.А.', 201, 212, 'АК-47', 'Буров О.С.', 'майор'),
('Іващенко А.А.', 201, 212, 'Глок20', 'Рибаков Н.Г.', 'майор'),
('Духов Р.М.', null, 200, 'АК-47', 'Буров О.С.', 'майор');


select * from Звітність_по_видачі_зброї;